{
  "versions": [
    {
      "version": "0.2.0",
      "data_reset": true,
      "features": [
        "Bearbeiten und Anlegen von Mitgliedern und Tätigkeiten",
        "In den Mitgliedsdetails werden nun mehr Infos angezeigt.",
        "Es wurden anonyme Tracking-Funktionen hinzugefügt, um die Nutzung der App analysieren zu können.",
        "Infos, wie die Entwicklung unterstütz werden kann wurde hinzugefügt.",
        "Es kann nach Belieben zwischen dem hellen und dunklen Design gewechselt werden."
      ],
      "bugFixes": [
        "Meldet man sich ohne Rechte an, kann man immer noch Führungszeugnis Unterlagen laden.",
        "Diverse weitere Fehlerbehebungen und Optimierungen"
      ]
    },
    {
      "version": "0.2.1",
      "data_reset": false,
      "features": [
        "Beenden der Mitgliedschaft",
        "Passive Mitglieder können nun ausgeblendet werden"
      ],
      "bugFixes": [
        "Ein Fehler bei dem Mitglieder ohne Stufe für den Stufenwechsel angezeigt wurden, wurde behoben.",
        "Diverse weitere Fehlerbehebungen und Optimierungen"
      ]
    },
    {
      "version": "0.2.2",
      "data_reset": false,
      "features": [],
      "bugFixes": [
        "Ein Fehler, der die App zum Absturz brachte wurde behoben."
      ]
    },
    {
      "version": "0.2.3",
      "data_reset": false,
      "features": [
        "Syncronisationshistorie, Protokoll der letzten Datenänderungen.",
        "Mehrere Optimierungen für einen besseren Umgang mit der App.",
        "Ein Dank an alle, die die Entwicklung unterstützen wurde hinzugefügt."
      ],
      "bugFixes": [
        "Login-Seite wird geöffnet, wenn Mitglieder bearbeitet werden sollen, ohne angemeldet zu sein.",
        "Zeitraum fürs beenden der Mitgliedschaft ohne Datenweiterverarbeitung wurde angepasst.",
        "Diverse weitere Fehlerbehebungen und Optimierungen"
      ]
    },
    {
      "version": "0.2.4",
      "data_reset": false,
      "features": [],
      "bugFixes": [
        "Kreditinstitute mit Umlauten verhindern nicht mehr das Anlegen eines Mitglieds.",
        "Ein Problem bei dem Leitende nur einen grauen Screen hatten wurde behoben.",
        "Die Stufenwechsel-Übersicht zeigt das Alter nicht mehr in Dezimal an."
      ]
    },
    {
      "version": "0.2.5",
      "data_reset": false,
      "features": [
        "Benachrichtigungen für Geburtstage - muss in den Einstellungen aktiviert werden.",
        "Einstellungen aufgeräumt und übersichtlicher gestaltet",
        "Das Android App Icon wurde angepasst (identisch zu iOS)"
      ],
      "bugFixes": []
    },
    {
      "version": "0.2.6",
      "data_reset": false,
      "features": [],
      "bugFixes": [
        "Ein Fehler verursacht durch den Nami Server wurde behoben, der das Einloggen verhinderte.",
        "Der Feedback-Button auf der Loginseite funktioniert nun wieder.",
        "Das DPSG Logo wurde aktualisiert."
      ]
    },
    {
      "version": "0.2.7",
      "data_reset": false,
      "features": [],
      "bugFixes": [
        "Die App berücksichtigt nun Safe Areas bei Android Geräten mit 3-Button-Navigation.",
        "Das Laden von Daten mit unterschiedlichen Berechtigungen sollte nun stabiler laufen und genauere Fehler liefern."
      ]
    }
  ]
}